// SPDX-License-Identifier: Apache-2.0
// sd_text.c —— 45 张卡的效果描述（与 sd_cards.c 的效果一一对应；改动必须两边同步）。
#include "sd_text.h"
#include "sd_core.h"

const char *sd_card_desc(uint8_t id)
{
    static const char *const DESC[] = {
        [0] = "无技能的普通武将。",
        [1] = "被破坏送入墓地时，抽1张卡。",
        [2] = "无技能的普通武将。",
        [3] = "布阵（守备）时统率+300。",
        [4] = "无技能的普通武将。",
        [5] = "无技能的普通武将。",
        [6] = "无技能的普通武将。",
        [7] = "上阵（出击）时武力+200。",
        [8] = "无技能的普通武将。",
        [9] = "无技能的普通武将。",
        [10] = "上阵时：封印1名敌将的攻击1回合。",
        [11] = "上阵时：敌方武力最高的武将武力-500。",
        [12] = "贯通：攻击布阵武将时，超出统率的部分照成兵力伤害。",
        [13] = "战斗破坏敌方武将后，武力+300。",
        [14] = "攻击宣言时，本回合武力+300。",
        [15] = "被战斗破坏时，回复1000兵力。",
        [16] = "无技能的普通武将。",
        [17] = "攻击宣言时，对方本回合不能发动伏兵。",
        [18] = "无技能的普通武将。",
        [19] = "贯通：攻击布阵武将时，超出统率的部分照成兵力伤害。",
        [20] = "无技能的普通武将。",
        [21] = "被战斗破坏时，破坏与之战斗的敌将。",
        [22] = "贯通；攻击布阵武将时武力+500。",
        [23] = "每回合可攻击2次。",
        [24] = "上阵时抽2张卡。",
        [25] = "我方回合开始时回复500兵力。",
        [26] = "光环：我方吴势力武将武力+300。",
        [27] = "抽2张卡。",
        [28] = "破坏1名布阵中的敌将。",
        [29] = "我方1名武将武力+1000，直到回合结束。",
        [30] = "全场武将武力-500，直到回合结束。",
        [31] = "装备：装备武将武力+800，且每回合可攻击2次。",
        [32] = "装备：装备武将武力+500，并获得贯通。",
        [33] = "我方武将上阵时回复400兵力。",
        [34] = "对方每次点兵，需多送1名武将入墓。",
        [35] = "抽1张卡，并回复600兵力。",
        [36] = "对方随机弃1张手牌。",
        [37] = "破坏对方所有武力不高于2000的武将。",
        [38] = "敌将攻击宣言时发动：破坏该武将。",
        [39] = "对方发动计略时发动：使其无效，对方随机弃1张手牌。",
        [40] = "破坏对方1名武将，并回复800兵力。",
        [41] = "我方场上没有武将时，对方不能攻阵。",
        [42] = "敌将上阵（出击）时发动：其武力-1000。",
        [43] = "我方布阵中的武将统率+500。",
        [44] = "我方武将被战斗破坏时发动：敌方受1000兵力伤害。",
    };
    if (id >= SD_CARD_COUNT || !DESC[id]) return "";
    return DESC[id];
}
